---
kind: method
id: M:Autodesk.Revit.UI.PulldownButton.GetItems
source: html/44f9bee0-c2e8-f0d2-8373-09d914d9647f.htm
---
# Autodesk.Revit.UI.PulldownButton.GetItems Method

Gets a copy of the collection of buttons assigned to the pulldown button.

## Syntax (C#)
```csharp
public IList<PushButton> GetItems()
```